Shakir555/nxp_boardParty/fdrm-mcxc444/mcu/internal_rtc.c
/*
 * Author: Shakir Salam
 * Internal RTC
 */

#include "fsl_debug_console.h"
#include "board.h"
#include "app.h"
#include "fsl_rtc.h"

// Definition
#define OSC_WAIT_TIME_MS 1000UL

// Function Prototypes
#if !(defined(FSL_FEATURE_RTC_HAS_NO_CR_OSCE) && FSL_FEATURE_RTC_HAS_NO_CR_OSCE)
// Wait for 32kHz OSC Clock Start Up
static void EXAMPLE_WaitOSCReady(uint32_t delay_ms);
#endif

// Variables
volatile bool busyWait;


#if !(defined(FSL_FEATURE_RTC_HAS_NO_CR_OSCE) && FSL_FEATURE_RTC_HAS_NO_CR_OSCE)

// Waiting for the OSC clock steady.
// Due to the oscillator startup time is depending on the hardware design and usually
// take hundreds of milliseconds to make the oscillator stable. Here, we just delay a certain
// time to ensure the oscillator stable, please use the suitable delay time to adapt
// to your real usage if needed.
static void EXAMPLE_WaitOSCReady(uint32_t delay_ms)
{
    uint32_t ticks = 0UL;
    uint32_t count = delay_ms;

    // Make a 1 milliseconds counter
    ticks = SystemCoreClock / 1000UL;
    assert((ticks - 1UL) <= SysTick_LOAD_RELOAD_Msk);

    // Enable the SysTick for counting
    SysTick->LOAD = (uint32_t)(ticks - 1UL);
    SysTick->VAL  = 0UL;
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;

    for (; count > 0U; count--)
    {
        // Wait for the SysTick counter reach 0
        while (!(SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk))
        {
        }
    }

    // Disable SysTick
    SysTick->CTRL &= ~(SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk);
    SysTick->LOAD = 0UL;
    SysTick->VAL  = 0UL;
}
#endif

// ISR for Alarm interrupt
// This function changes the state of busyWait.
void RTC_IRQHandler(void)
{
    uint32_t status = RTC_GetStatusFlags(RTC);

    if (status & kRTC_AlarmFlag)
    {
        busyWait = false;

        // Clear alarm flag
        RTC_ClearStatusFlags(RTC, kRTC_AlarmInterruptEnable);
    }
    else if (status & kRTC_TimeInvalidFlag)
    {
        // Clear timer invalid flag
        RTC_ClearStatusFlags(RTC, kRTC_TimeInvalidFlag);
    }
    else
    {
    }
    SDK_ISR_EXIT_BARRIER;
}


int main(void)
{
    uint32_t sec;
    uint32_t currSeconds;
    uint8_t index;
    rtc_datetime_t date;
    rtc_config_t rtcConfig;

    // Board pin, clock, debug console init
    BOARD_InitHardware();

    // Init RTC
    RTC_GetDefaultConfig(&rtcConfig);
    RTC_Init(RTC, &rtcConfig);
#if (defined(EXAMPLE_SEL_LPO_1KHZ_CLOCK) && EXAMPLE_SEL_LPO_1KHZ_CLOCK)
    // The RTC prescaler increments using the LPO 1 kHz clock intead of RTC 32.768 kHz clock.*/
    RTC->CR |= RTC_CR_LPOS_MASK;
#endif
#if !(defined(FSL_FEATURE_RTC_HAS_NO_CR_OSCE) && FSL_FEATURE_RTC_HAS_NO_CR_OSCE)
    // If the oscillator has not been enabled
    if (0U == (RTC->CR & RTC_CR_OSCE_MASK))
    {
        // Select RTC clock source
        RTC_SetClockSource(RTC);

        // Wait for OSC clock steady
        EXAMPLE_WaitOSCReady(OSC_WAIT_TIME_MS);
    }
#endif
#if (defined(EXAMPLE_CAP_LOAD_VALUE) && EXAMPLE_CAP_LOAD_VALUE)
#if (defined(FSL_FEATURE_RTC_HAS_OSC_SCXP) && FSL_FEATURE_RTC_HAS_OSC_SCXP)
    // Change the RTC oscillator capacity load value
    RTC_SetOscCapLoad(RTC, EXAMPLE_CAP_LOAD_VALUE);
#endif
#endif

    PRINTF("RTC example: set up time to wake up an alarm\r\n");

    // Set a start date time and start RT
    date.year   = 2026U;
    date.month  = 2U;
    date.day    = 4U;
    date.hour   = 3U;
    date.minute = 0;
    date.second = 0;

    // RTC time counter has to be stopped before setting the date & time in the TSR register
    RTC_StopTimer(RTC);

    // Set RTC time to default
    RTC_SetDatetime(RTC, &date);

    // Enable at the NVIC
    EnableIRQ(RTC_IRQn);

    // Start the RTC time counter
    RTC_StartTimer(RTC);

    // This loop will set the RTC alarm
    while (1)
    {
        busyWait = true;
        index    = 0;
        sec      = 0;

        // Get date time
        RTC_GetDatetime(RTC, &date);

        // print default time
        PRINTF("Current datetime: %04hd-%02hd-%02hd %02hd:%02hd:%02hd\r\n", date.year, date.month, date.day, date.hour,
               date.minute, date.second);

        // Read the RTC seconds register to get current time in seconds
        currSeconds = RTC->TSR;

        // Add alarm seconds to current time, because RTC alarm will happen when RTC->TAR = RTC->TSR and RTC->TSR
        // increments, thus there's possible 1 second maximum delay here.
        currSeconds += sec;

#if defined(FSL_FEATURE_RTC_HAS_ERRATA_010716) && (FSL_FEATURE_RTC_HAS_ERRATA_010716)
        // Disable time counter
        RTC_StopTimer(RTC);
#endif

        // Set alarm time in seconds
        RTC->TAR = currSeconds;

#if defined(FSL_FEATURE_RTC_HAS_ERRATA_010716) && (FSL_FEATURE_RTC_HAS_ERRATA_010716)
        // Re-enable the time counter
        RTC_StartTimer(RTC);
#endif

        // Wait
        while (busyWait)
        {
        }
    }
}
